package org.example._20240816S;

public class Main {
    public static void main(String[] args) {
//        Продолжаем работу над калькулятором.
//Обновите "Калькулятор" до версии 2,
//Обновите функционал до производящего вычисления (+, -, *, /)
// с произвольным количеством чисел c дробной частью.
//Количество аргументов пользователь вводит с клавиатуры. Оно должно быть от 2 и более.
//Тип данных вводимых аргументов должен быть Double.
//Далее пользователь последовательно вводит значение каждого из аргументов, а затем - знак математической операции, которую необходимо выполнить со значениями введенных аргументов. 
//Результат работы программы необходимо вывести в виде вычисляемого выражения и полученного результата с точностью до двух чисел после запятой.

        Calculator2 calculator = new Calculator2();
        calculator.run();
    }
}
