package org.example._20240604;

public class PraktikaDoWhile {
    public static void main(String[] args) {
//        Используйте цикл do-while
//Инициализируйте переменную int i = 0;
//Добавьте в тело инструкцию System.out.println("Я в теле DO");
//Определите условие i < 3
//Запустите код
//Определите условие i < 0
//Проанализируйте результат
        int i = 0;
        do {
            //Задача 1
            System.out.println("Я в теле DO. И буду там, пока i не будет больше 3. Сейчас i = " + i);
            i++;
        } while (i < 3);

    }
}
