package org.example._20240801;

public class DoWhile {
    public static void main(String[] args) {
        int i = 10;
        do {
            System.out.println(i);
            i++;
        } while (i < 5);
//        while (i < 5) {
//            System.out.println("JAVA");
//            i++;
//        }


//        Используйте цикл do-while
//        Инициализируйте переменную int i = 0;
//        Добавьте в тело инструкцию System.out.println("Я в теле DO");
//        Определите условие i < 3
//        Запустите код
//        Определите условие i < 0
//        Проанализируйте результат

        int k = 0;
        do {
            System.out.println("Я в теле DO");
        }
//        while (k < 3) ;
        while (k < 0) ;

// Вы реализуете игру, в которой вы показываете пользователю некоторые параметры,
//нажмите 1, чтобы сделать это...,
//нажмите 2, чтобы сделать это... и т. д.,
//и нажмите "Q", чтобы выйти из игры.
//Реализуйте меню выбора игрока (Elf or Orc and Exit)
//Отобразите меню
//1. Elf
//2. Orc
//3. Exit
//Проверьте ввод на соответствие, в случае неверного ввода распечатайте "Choose any one : " и покажите меню выбора
//Сохраните выбор
//Распечатайте выбор в консоль
}
}