package org.example._20240807.Pen;

public class Pen {

        private String color;  //a. Определите свойство color типа String с доступом private

//    Создайте методы getColor();
        public String getColor () {
           return color;
        }

        public void setColor (String color) {
            this.color = color;

        }

    }
//        Создайте класс ручка (Pen)
//        a. Определите свойство color типа String с доступом private
//        b. Создайте методы getColor(); setColor(String newColor);
//        2. Создайте класс Test
//        3. Создайте три объекта типа Pen
//        4. Создайте массив L = 3
//        5. Сохраните все объекты в массив
//        6. Достаньте поочередно из массива ручки и измените цвет каждой на
//        a. “Green”
//        b. “Red”
//        c. “Black”
//        7. Инициализируйте массив числами от 1 до 10 используя способ литерала
//        8. Выведите на консоль элемент из второй ячейки
//        9. Распечатайте на консоль все элементы из ячеек массива
//        10. Проанализируйте выход в консоле
//        11. Распечатайте цвета ручек из массива





